grevaillot/svd_tools/headers/STM32H753x/gpioh.h
#pragma once 

/* --- GPIOH: GPIO -------------------------------------------------- */

/** @defgroup gpioh_registers GPIO Register
@{*/

/** GPIOH_MODER GPIO port mode register **/
#define GPIOH_MODER			MMIO32(GPIOH_BASE + 0x00)
/** GPIOH_OTYPER GPIO port output type register **/
#define GPIOH_OTYPER			MMIO32(GPIOH_BASE + 0x04)
/** GPIOH_OSPEEDR GPIO port output speed register **/
#define GPIOH_OSPEEDR			MMIO32(GPIOH_BASE + 0x08)
/** GPIOH_PUPDR GPIO port pull-up/pull-down register **/
#define GPIOH_PUPDR			MMIO32(GPIOH_BASE + 0x0c)
/** GPIOH_IDR GPIO port input data register **/
#define GPIOH_IDR			MMIO32(GPIOH_BASE + 0x10)
/** GPIOH_ODR GPIO port output data register **/
#define GPIOH_ODR			MMIO32(GPIOH_BASE + 0x14)
/** GPIOH_BSRR GPIO port bit set/reset register **/
#define GPIOH_BSRR			MMIO32(GPIOH_BASE + 0x18)
/** GPIOH_LCKR This register is used to lock the configuration of the port bits when a correct write sequence is applied to bit 16 (LCKK). The value of bits [15:0] is used to lock the configuration of the GPIO. During the write sequence, the value of LCKR[15:0] must not change. When the LOCK sequence has been applied on a port bit, the value of this port bit can no longer be modified until the next MCU reset or peripheral reset.A specific write sequence is used to write to the GPIOx_LCKR register. Only word access (32-bit long) is allowed during this locking sequence.Each lock bit freezes a specific configuration register (control and alternate function registers). **/
#define GPIOH_LCKR			MMIO32(GPIOH_BASE + 0x1c)
/** GPIOH_AFRL GPIO alternate function low register **/
#define GPIOH_AFRL			MMIO32(GPIOH_BASE + 0x20)
/** GPIOH_AFRH GPIO alternate function high register **/
#define GPIOH_AFRH			MMIO32(GPIOH_BASE + 0x24)

/**@}*/


/** @defgroup gpioh_moder MODER GPIO port mode register
@{*/


#define GPIOH_MODER_MODE15_SHIFT		30
#define GPIOH_MODER_MODE15_MASK		0x03
/** @defgroup gpioh_moder_mode15 MODE15 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE14_SHIFT		28
#define GPIOH_MODER_MODE14_MASK		0x03
/** @defgroup gpioh_moder_mode14 MODE14 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE13_SHIFT		26
#define GPIOH_MODER_MODE13_MASK		0x03
/** @defgroup gpioh_moder_mode13 MODE13 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE12_SHIFT		24
#define GPIOH_MODER_MODE12_MASK		0x03
/** @defgroup gpioh_moder_mode12 MODE12 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE11_SHIFT		22
#define GPIOH_MODER_MODE11_MASK		0x03
/** @defgroup gpioh_moder_mode11 MODE11 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE10_SHIFT		20
#define GPIOH_MODER_MODE10_MASK		0x03
/** @defgroup gpioh_moder_mode10 MODE10 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE9_SHIFT		18
#define GPIOH_MODER_MODE9_MASK		0x03
/** @defgroup gpioh_moder_mode9 MODE9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE8_SHIFT		16
#define GPIOH_MODER_MODE8_MASK		0x03
/** @defgroup gpioh_moder_mode8 MODE8 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE7_SHIFT		14
#define GPIOH_MODER_MODE7_MASK		0x03
/** @defgroup gpioh_moder_mode7 MODE7 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE6_SHIFT		12
#define GPIOH_MODER_MODE6_MASK		0x03
/** @defgroup gpioh_moder_mode6 MODE6 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE5_SHIFT		10
#define GPIOH_MODER_MODE5_MASK		0x03
/** @defgroup gpioh_moder_mode5 MODE5 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE4_SHIFT		8
#define GPIOH_MODER_MODE4_MASK		0x03
/** @defgroup gpioh_moder_mode4 MODE4 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE3_SHIFT		6
#define GPIOH_MODER_MODE3_MASK		0x03
/** @defgroup gpioh_moder_mode3 MODE3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE2_SHIFT		4
#define GPIOH_MODER_MODE2_MASK		0x03
/** @defgroup gpioh_moder_mode2 MODE2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE1_SHIFT		2
#define GPIOH_MODER_MODE1_MASK		0x03
/** @defgroup gpioh_moder_mode1 MODE1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOH_MODER_MODE0_SHIFT		0
#define GPIOH_MODER_MODE0_MASK		0x03
/** @defgroup gpioh_moder_mode0 MODE0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioh_otyper OTYPER GPIO port output type register
@{*/

/** GPIOH_OTYPER_OT15 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT15		(1 << 15)
/** GPIOH_OTYPER_OT14 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT14		(1 << 14)
/** GPIOH_OTYPER_OT13 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT13		(1 << 13)
/** GPIOH_OTYPER_OT12 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT12		(1 << 12)
/** GPIOH_OTYPER_OT11 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT11		(1 << 11)
/** GPIOH_OTYPER_OT10 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT10		(1 << 10)
/** GPIOH_OTYPER_OT9 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT9		(1 << 9)
/** GPIOH_OTYPER_OT8 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT8		(1 << 8)
/** GPIOH_OTYPER_OT7 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT7		(1 << 7)
/** GPIOH_OTYPER_OT6 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT6		(1 << 6)
/** GPIOH_OTYPER_OT5 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT5		(1 << 5)
/** GPIOH_OTYPER_OT4 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT4		(1 << 4)
/** GPIOH_OTYPER_OT3 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT3		(1 << 3)
/** GPIOH_OTYPER_OT2 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT2		(1 << 2)
/** GPIOH_OTYPER_OT1 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT1		(1 << 1)
/** GPIOH_OTYPER_OT0 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOH_OTYPER_OT0		(1 << 0)

/**@}*/

/** @defgroup gpioh_ospeedr OSPEEDR GPIO port output speed register
@{*/


